

// 大項目　→　中項目　→　['小項目': 所要時間]



const textGroup = [
    [
        // 大項目：家事
        [
            // 中項目：掃除（居室）
            [
                ['1ROOM', 30],
                ['1K', 30],
                ['2LDK', 50],
                ['3LDK', 70],
                ['4LDK', 90]
            ],
            // 中項目：掃除（水回り）
            [
                ['台所', 30],
                ['風呂', 20],
                ['トイレ', 15]
            ],
            // 中項目：掃除
            [
                ['ゴミ出し', 15]
            ],
            // 中項目：調理
            [
                ['1人分', 60],
                ['2人分', 70],
                ['3人分', 80],
                ['4人分', 90],
                ['下膳・後片付け', 20]
            ],
            // 中項目：洗濯
            [
                ['洗濯', 15],
                ['洗濯物干し', 30],
                ['取込み・たたみ', 30],
                ['アイロンがけ', 30]
            ],
            // 中項目：買物
            [
                ['近隣', 30],
                ['遠方', 45]
            ],
            // 中項目：ペット
            [
                ['犬の散歩', 30],
                ['エサやり', 60]
            ],
            // 中項目：庭
            [
                ['草むしり', 60],
                ['水やり', 30],
                ['庭掃除', 30]
            ],
            // 中項目：大掃除
            [
                ['換気扇', 45],
                ['窓ふき', 60]
            ],
            // 中項目：衣替え
            [
                ['衣替え', 180]
            ],
            // 中項目：引越し
            [
                ['引越し後の片付け', 180]
            ]
        ],
        // 大項目：介護
        [
            // 中項目：外出介助
            [
                ['冠婚葬祭', 300],
                ['通院', 240],
                ['買い物', 90]
            ],
            // 中項目：介護
            [
                ['食事介助', 60],
                ['入浴介助', 60]
            ]
        ],
        // 大項目：ベビーシッター
        [
            // 中項目：送迎
            [
               ['保育園、幼稚園などの', 60] 
            ],
            // 中項目：遊び相手
            [
                ['見守り', 180]
            ],
            // 中項目：食事
            [
                ['食事介助', 60]
            ],
            // 中項目：整容
            [
                ['入浴', 60],
                ['着替え', 15],
                ['洗面・口腔ケア', 15]
            ]
        ]]
];


export default textGroup;